/*
*********************************************************************************************************
* 文件: Touch_Screen.C
* 描述: 此处函数 GUI 中定义了,但此次移植并未使用.
* 编写: 深思 (001-12345@sohu.com).
*********************************************************************************************************
*/
#include  "config.h"
/*从GUI_TOUCH_Exec()调用这些函数以激活X 和Y 轴的测量。 TOUCH_X_ActivateX () 接
通X 轴的测量电压；TOUCH_X_ActivateY()接通Y 轴的电压。接通X 轴电压意思是X 轴的值能
够测量了，反之亦然。*/

void TOUCH_X_ActivateX(void)
{
}

void TOUCH_X_ActivateY(void)
{
}

void TOUCH_X_Disable(void)  
 {

}
/*从GUI_TOUCH_Exec ()调用这些函数以返回来自A/D 转换器的X 和Y 轴的测定值。*/
extern  int xdata, ydata;
int  TOUCH_X_MeasureX(void)
{
    return xdata;
}

int  TOUCH_X_MeasureY(void)
{
    return ydata;
}

/*
********************************************************************************************************
* End.
********************************************************************************************************
*/
